// Անհրաժեշտ է կառուցել և արտածել nxn չափանի մատրից, 
// որը ստացվում է 1-ից մինչև n*n ամբողջ թվերը հետևյալ հերթականությամբ այդ մատրիցում գրելուց.
// Սկզբում թվերը վերևից ներքև գրել առաջին սյունում, 
// այնուհետև ներքևից վերև գրել երկրորդ սյունում, 
// որից հետո վերևից ներքև գրել երրորդ սյունում 
// և այդպես շարունակ մինչև մատրիցի վերջին սյունը: 

const int MATRIX_SIZE = 4;

void create_snake_matrix(int arr[MATRIX_SIZE][MATRIX_SIZE])
{
    int n = 1;

    for (int i = 0; i < MATRIX_SIZE; ++i)
    {
        for (int j = 0; j < MATRIX_SIZE; ++j)
        {
            if (i % 2 == 0)
            {
                arr[j][i] = n;
            }
            else 
            {
                arr[MATRIX_SIZE - 1 - j][i] = n;
            }
            ++n; 
        }
    }
}